# ClosedLoop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GridChainSketchFailures..::..ClosedLoop Property
BuiltInFailures..::..GridChainSketchFailures Class See Also
---
GridChain sketch contains a closed loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ClosedLoop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ClosedLoop As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ClosedLoop {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GridChainSketchFailures Class
Autodesk.Revit.DB Namespace